{
  "S01E01": {
    "title": "Pilot (Rick and Morty)",
    "description": "The pilot episode of the American animated television sitcom Rick and Morty was written by series creators Dan Harmon and Justin Roiland, and directed by Justin Roiland. The episode premiered on Adult Swim on December 2, 2013. The series introduces the series' protagonist protagonists—alcoholic scientist Rick Sanchez and his innocent teenage grandson Morty Smith—as they embark on a dangerous interdimensional adventure to fetch Mega Tree seeds. The pilot had a positive reception and was seen by about 1.1 million viewers when it premiered.",
    "source": "https://en.wikipedia.org/wiki/Pilot_(Rick_and_Morty)"
  },
  "S01E02": {
    "title": "Lawnmower Dog",
    "description": "\"Lawnmower Dog\" is the second episode of Rick and Morty. It premiered on Adult Swim on December 9, 2013, was written by Ryan Ridley, and directed by John Rice. In the episode, Rick gives Jerry a device to enhance the dog's intelligence while Rick and Morty get lost in the dreams of Morty's math teacher. The episode was well received by critics, and it was seen by approximately 1.5 million viewers when it premiered.",
    "source": "https://en.wikipedia.org/wiki/Lawnmower_Dog"
  },
  "S01E03": {
    "title": "Anatomy Park",
    "description": "\"Anatomy Park\" is the third episode of the first season of the American science fiction television series Rick and Morty. Written by Eric Acosta and Wade Randolph and directed by John Rice, the episode aired on December 16, 2013, and is a parody of both the 1966 film Fantastic Voyage and the Jurassic Park franchise.",
    "source": "https://en.wikipedia.org/wiki/Anatomy_Park"
  },
  "S01E04": {
    "title": "M. Night Shaym-Aliens!",
    "description": "\"M. Night Shaym-Aliens!\" is the fourth episode of the first season of the American science fiction television series Rick and Morty. Directed by Jeff Myers and written by Tom Kauffman, the episode was aired on January 13, 2014. It stars Justin Roiland as both titular characters, Rick Sanchez and Morty Smith, Chris Parnell as Jerry Smith, and Sarah Chalke as Beth Smith. Summer Smith, a series regular voiced by Spencer Grammer, does not appear in the episode.",
    "source": "https://en.wikipedia.org/wiki/M._Night_Shaym-Aliens!"
  },
  "S01E05": {
    "title": "Meeseeks and Destroy",
    "description": "\"Meeseeks and Destroy\" is the fifth episode of the first season of Rick and Morty. It premiered on Adult Swim on January 20, 2014. The episode was written by Ryan Ridley and directed by Bryan Newton. In the episode, Rick provides the family with a solution to their problems, freeing him up to go on an adventure led by Morty. The episode received largely positive reviews from critics, many of whom regard it as one of the series' best episodes. It was seen by about 1.6 million viewers when it was first aired on Adult Swim.",
    "source": "https://en.wikipedia.org/wiki/Meeseeks_and_Destroy"
  },
  "S01E06": {
    "title": "Rick Potion No. 9",
    "description": "\"Rick Potion #9\" is the sixth episode of Rick and Morty. It premiered on Adult Swim on January 27, 2014, was written by Justin Roiland, and directed by Stephen Sandoval. In the episode, a love potion goes wrong, creating a virus that begins to infect the entire world population, making everyone fall in love with Morty. The episode received critical acclaim, receiving praise for its story, subplot, and ending. It was seen by 1.7 million viewers at first airing. The title of the episode is in reference to the 1959 song \"Love Potion No. 9\" by the Clovers.",
    "source": "https://en.wikipedia.org/wiki/Rick_Potion_No._9"
  },
  "S01E07": {
    "title": "Raising Gazorpazorp",
    "description": "\"Raising Gazorpazorp\" is the seventh episode of the first season of the American television series Rick and Morty. It was directed by Jeff Myers and written by Eric Acosta and Wade Randolph, and aired on March 10, 2014. The episode has received mixed reviews from critics. The title of the episode is a play on words to the film Raising Arizona and the television series Raising Hope.",
    "source": "https://en.wikipedia.org/wiki/Raising_Gazorpazorp"
  },
  "S01E08": {
    "title": "Rixty Minutes",
    "description": "\"Rixty Minutes\" is the eighth episode of the first season of Rick and Morty. It premiered on Adult Swim on March 17, 2014. The episode was written by Tom Kauffman and Justin Roiland, and directed by Bryan Newton. In the episode, Rick and Morty watch cable from other dimensions, while Jerry, Beth, and Summer watch alternate reality versions of themselves using a pair of interdimensional goggles. The episode was well received by critics, and it was watched by about 1.48 million viewers in the United States.",
    "source": "https://en.wikipedia.org/wiki/Rixty_Minutes"
  },
  "S01E09": {
    "title": "Something Ricked This Way Comes",
    "description": "\"Something Ricked This Way Comes\" is the ninth episode of the first season of the American science fiction comedy television series Rick and Morty. Aired on March 24, 2014, the episode was directed by John Rice and written by Mike McMahan. The episode aired on March 6, 2016 in Canada. It stars Justin Roiland as Rick Sanchez and Morty Smith.",
    "source": "https://en.wikipedia.org/wiki/Something_Ricked_This_Way_Comes"
  },
  "S01E10": {
    "title": "Close Rick-counters of the Rick Kind",
    "description": "\"Close Rick-counters of the Rick Kind\" is the tenth and penultimate episode of the first season of the American science fiction comedy animated television series Rick and Morty. Directed by Stephen Sandoval and written by Ryan Ridley, the episode aired on April 7, 2014. With a title alluding to the 1977 film Close Encounters of the Third Kind, the episode is notable for introducing both the rules of the franchise's multiverse and the series' main antagonist — \"Evil Morty\" — whose storyline is continued across the 2017 third season episode \"The Ricklantis Mixup\", the 2020 short film \"Rick and Morty vs. Genocider\", the 2021 fifth season finale \"Rickmurai Jack\", and the 2023 seventh season episode \"Unmortricken\".",
    "source": "https://en.wikipedia.org/wiki/Close_Rick-counters_of_the_Rick_Kind"
  },
  "S01E11": {
    "title": "Ricksy Business",
    "description": "\"Ricksy Business\" is the eleventh and final episode of the first season of the American science fiction television series Rick and Morty. Written by Ryan Ridley and Tom Kauffman and directed by Stephen Sandoval, the episode aired on April 14, 2014. The title of the episode is a pun to the film, Risky Business.",
    "source": "https://en.wikipedia.org/wiki/Ricksy_Business"
  },
  "S02E01": {
    "title": "A Rickle in Time",
    "description": "\"A Rickle in Time\" is the first episode in the second season of the American animated television sitcom Rick and Morty, and the twelfth overall episode of the series. Written by Matt Roller and directed by Wes Archer, the episode first aired on Adult Swim in the United States on July 26, 2015. The title of the episode is a pun to the novel, A Wrinkle in Time.",
    "source": "https://en.wikipedia.org/wiki/A_Rickle_in_Time"
  },
  "S02E02": {
    "title": "Mortynight Run",
    "description": "\"Mortynight Run\" is the second episode of the second season of the Adult Swim animated television series Rick and Morty. Written by David Phillips and directed by Dominic Polcino, the episode premiered on August 2, 2015, though it was leaked online beforehand. After dropping Jerry at a daycare purpose-built for alternate universe versions of Jerry, Rick sells a gun to the assassin Krombopulos Michael, but Morty decides to save his target—a telepathic gas-based entity.",
    "source": "https://en.wikipedia.org/wiki/Mortynight_Run"
  },
  "S02E03": {
    "title": "Rick and Morty season 2",
    "description": "The second season of the animated television series Rick and Morty originally aired on Cartoon Network's late night programming block Adult Swim in the United States on July 26, 2015, with \"A Rickle in Time\", and concluded on October 4 with \"The Wedding Squanchers\". This season aired a total of ten episodes.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_2"
  },
  "S02E04": {
    "title": "Total Rickall",
    "description": "\"Total Rickall\" is the fourth episode of the second season of the Adult Swim animated television series Rick and Morty. Written by Mike McMahan and directed by Juan Meza-León, the episode premiered on August 16, 2015. It shows the Smith family, along with Mr. Poopybutthole, overwhelmed by an infestation of parasites who implant false memories into them so they cannot tell who is real.",
    "source": "https://en.wikipedia.org/wiki/Total_Rickall"
  },
  "S02E05": {
    "title": "Rick and Morty season 2",
    "description": "The second season of the animated television series Rick and Morty originally aired on Cartoon Network's late night programming block Adult Swim in the United States on July 26, 2015, with \"A Rickle in Time\", and concluded on October 4 with \"The Wedding Squanchers\". This season aired a total of ten episodes.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_2"
  },
  "S02E06": {
    "title": "The Ricks Must Be Crazy",
    "description": "\"The Ricks Must Be Crazy\" is the sixth episode in the second season of the American animated television sitcom Rick and Morty, and the seventeenth overall episode in the series. Written by Dan Guterman and directed by Dominic Polcino, the episode first aired on Adult Swim in the United States on August 30, 2015. The title of the episode is a reference to the 1980 film The Gods Must Be Crazy.",
    "source": "https://en.wikipedia.org/wiki/The_Ricks_Must_Be_Crazy"
  },
  "S02E07": {
    "title": "Rick and Morty season 2",
    "description": "The second season of the animated television series Rick and Morty originally aired on Cartoon Network's late night programming block Adult Swim in the United States on July 26, 2015, with \"A Rickle in Time\", and concluded on October 4 with \"The Wedding Squanchers\". This season aired a total of ten episodes.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_2"
  },
  "S02E08": {
    "title": "Rick and Morty season 2",
    "description": "The second season of the animated television series Rick and Morty originally aired on Cartoon Network's late night programming block Adult Swim in the United States on July 26, 2015, with \"A Rickle in Time\", and concluded on October 4 with \"The Wedding Squanchers\". This season aired a total of ten episodes.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_2"
  },
  "S02E09": {
    "title": "Rick and Morty season 2",
    "description": "The second season of the animated television series Rick and Morty originally aired on Cartoon Network's late night programming block Adult Swim in the United States on July 26, 2015, with \"A Rickle in Time\", and concluded on October 4 with \"The Wedding Squanchers\". This season aired a total of ten episodes.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_2"
  },
  "S02E10": {
    "title": "The Wedding Squanchers",
    "description": "\"The Wedding Squanchers\" is the tenth and final episode of the second season of the American animated television sitcom Rick and Morty, and the 21st overall episode of the series. Written by Tom Kauffman and directed by Wes Archer, the episode first aired on Adult Swim in the United States on October 4, 2015.",
    "source": "https://en.wikipedia.org/wiki/The_Wedding_Squanchers"
  },
  "S03E01": {
    "title": "The Rickshank Rickdemption",
    "description": "\"The Rickshank Rickdemption\" is the first episode in the third season of the American animated television sitcom Rick and Morty, and the twenty-second episode overall in the series. It was written by Mike McMahan and directed by Juan Meza-Leon. The season three premiere first aired unannounced on Adult Swim in the United States on April 1, 2017 when it was watched by 676,000 American households in its initial airing. On the first day of its original broadcast, \"The Rickshank Rickdemption\" was replayed every half hour from 8pm to 12am ET with improved ratings, as a part of Adult Swim's annual April Fools' Day joke.",
    "source": "https://en.wikipedia.org/wiki/The_Rickshank_Rickdemption"
  },
  "S03E02": {
    "title": "Rickmancing the Stone",
    "description": "\"Rickmancing the Stone\" is the second episode of the third season of the American science fiction television series Rick and Morty. Released on July 30, 2017, it follows main characters Rick Sanchez and Morty Smith as they enter a post-apocalyptic world to find the gemstone by the name of Isotope 322, also bringing Morty's sister Summer with them. The episode was written by Jane Becker and directed by Dominic Polcino. The title is a reference to the 1984 film Romancing the Stone with Michael Douglas.",
    "source": "https://en.wikipedia.org/wiki/Rickmancing_the_Stone"
  },
  "S03E03": {
    "title": "Pickle Rick",
    "description": "\"Pickle Rick\" is the third episode of the third season of the Adult Swim animated television series Rick and Morty. Written by Jessica Gao and directed by Anthony Chun, the episode premiered on August 6, 2017. The plot follows eccentric scientist Rick Sanchez as he turns himself into a pickle to avoid attending a family therapy session.",
    "source": "https://en.wikipedia.org/wiki/Pickle_Rick"
  },
  "S03E04": {
    "title": "Vindicators 3: The Return of Worldender",
    "description": "\"Vindicators 3: The Return of Worldender\" is the fourth episode of the third season of the Adult Swim animated television series Rick and Morty. Written by Sarah Carbiener and Erica Rosbe and directed by Bryan Newton, the episode premiered on August 13, 2017. Parodying many superhero movie tropes, \"Vindicators 3\" sees Rick and Morty join the Vindicators in a mission to defeat Worldender. However, a drunken Rick defeats Worldender alone and sets up a series of Saw-inspired challenges for the Vindicators to complete the next day; by morning, he has forgotten the entire event. The episode received positive reviews and was watched by an estimated 2.66 million viewers upon its premiere.",
    "source": "https://en.wikipedia.org/wiki/Vindicators_3%3A_The_Return_of_Worldender"
  },
  "S03E05": {
    "title": "The Whirly Dirly Conspiracy",
    "description": "\"The Whirly Dirly Conspiracy\" is the fifth episode of the third season of the American science fiction comedy television series Rick and Morty. In the episode, Rick takes Jerry on a mission to an alien resort when the latter feels left out, and Summer accidentally grows to a huge size and inside-out. The episode received positive reviews from critics, who praised the storyline and humor.",
    "source": "https://en.wikipedia.org/wiki/The_Whirly_Dirly_Conspiracy"
  },
  "S03E06": {
    "title": "Rest and Ricklaxation",
    "description": "\"Rest and Ricklaxation\" is the sixth episode of the third season of the American science fiction television series Rick and Morty. The episode is written by Tom Kauffman and directed by Anthony Chun, aired on Adult Swim on August 27, 2017. Chris Parnell does not appear as main character Jerry Smith in the episode.",
    "source": "https://en.wikipedia.org/wiki/Rest_and_Ricklaxation"
  },
  "S03E07": {
    "title": "The Ricklantis Mixup",
    "description": "\"The Ricklantis Mixup\" is the seventh episode of the third season of Rick and Morty, and the twenty-eighth episode of the series overall. It premiered on Adult Swim on September 10, 2017. It was written by Dan Guterman and Ryan Ridley, and directed by Dominic Polcino. In the episode, as the main Rick and Morty adventure offscreen to Atlantis, the focus is shifted towards the Citadel, an interdimensional society populated by numerous versions of Ricks and Mortys from different realities. The episode received critical acclaim and is considered by some to be the best episode of the show, with approximately 2.4 million viewers when airing. A stand-alone sequel to the first season episode \"Close Rick-counters of the Rick Kind\", its narrative was continued in the fifth season finale \"Rickmurai Jack\" and the seventh season episode \"Unmortricken\".",
    "source": "https://en.wikipedia.org/wiki/The_Ricklantis_Mixup"
  },
  "S03E08": {
    "title": "Morty's Mind Blowers",
    "description": "\"Morty's Mind Blowers\" is the eighth episode of the third season of the American science fiction television series Rick and Morty. It follows the two titular characters, both voiced by Justin Roiland, as they experiment with Morty's lost memories. The episode was directed by Bryan Newton and written by various screenwriters, including Mike McMahan, who would later serve as a producer on the fourth season, and both series creators Roiland and Dan Harmon. \"Morty's Mind Blowers\" originally aired on Adult Swim on September 17, 2017, and was watched by 2.51 million viewers. A comic sequel of the same name, written by Kyle Starks, Tini Howard, Sarah Graley, Benjamin Dewey, and Josh Trujillo, with designs by Angie Knowles and Roiland's personal approval, was published by Oni Press in Rick and Morty #50 on May 29, 2019.",
    "source": "https://en.wikipedia.org/wiki/Morty's_Mind_Blowers"
  },
  "S03E09": {
    "title": "The ABC's of Beth",
    "description": "\"The ABC's of Beth\" is the ninth episode of the third season of the American science fiction television series Rick and Morty. Airing on September 24, 2017, the episode was directed by Juan Meza-León and written by Mike McMahan.",
    "source": "https://en.wikipedia.org/wiki/The_ABC's_of_Beth"
  },
  "S03E10": {
    "title": "The Rickchurian Mortydate",
    "description": "\"The Rickchurian Mortydate\" is the tenth and final episode of the third season of the American science fiction television series Rick and Morty follows the titular grandson and grandfather duo as they feud with the President of the United States. The episode, directed by Anthony Chun and written by series co-creator Dan Harmon, aired on Adult Swim on October 1, 2017.",
    "source": "https://en.wikipedia.org/wiki/The_Rickchurian_Mortydate"
  },
  "S04E01": {
    "title": "Edge of Tomorty: Rick Die Rickpeat",
    "description": "\"Edge of Tomorty: Rick Die Rickpeat\" is the premiere episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Mike McMahan and directed by Erica Hayes, loosely adapting Akira by Katsuhiro Otomo, the episode was broadcast on November 10, 2019. The episode received positive reviews from critics. A stand-alone graphic novel miniseries, Rick and Morty: Worlds Apart, serving as a sequel, was published by Oni Press from February 3 to May 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Edge_of_Tomorty%3A_Rick_Die_Rickpeat"
  },
  "S04E02": {
    "title": "The Old Man and the Seat",
    "description": "\"The Old Man and the Seat\" is the second episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Michael Waldron and directed by Jacob Hair, loosely adapting The Old Man and the Sea by Ernest Hemingway, the episode aired in the United States on November 17, 2019. It received mostly positive reception from critics.",
    "source": "https://en.wikipedia.org/wiki/The_Old_Man_and_the_Seat"
  },
  "S04E03": {
    "title": "One Crew over the Crewcoo's Morty",
    "description": "\"One Crew over the Crewcoo's Morty\" is the third episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Caitie Delaney and directed by Bryan Newton, the episode was broadcast on November 24, 2019. The title is a play on the title One Flew Over the Cuckoo's Nest.",
    "source": "https://en.wikipedia.org/wiki/One_Crew_over_the_Crewcoo's_Morty"
  },
  "S04E04": {
    "title": "Claw and Hoarder: Special Ricktim's Morty",
    "description": "\"Claw and Hoarder: Special Ricktim's Morty\" is the fourth episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Jeff Loveness and directed by Anthony Chun, the episode was broadcast on December 8, 2019. A stand-alone sequel miniseries, Rick and Morty: Worlds Apart, was published by Oni Press from February 3 to May 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Claw_and_Hoarder%3A_Special_Ricktim's_Morty"
  },
  "S04E05": {
    "title": "Rattlestar Ricklactica",
    "description": "\"Rattlestar Ricklactica\" is the fifth episode of the fourth season of the Adult Swim animated television series Rick and Morty. The 36th episode overall, it was written by James Siciliano and directed by Jacob Hair and was broadcast on December 15, 2019.",
    "source": "https://en.wikipedia.org/wiki/Rattlestar_Ricklactica"
  },
  "S04E06": {
    "title": "Never Ricking Morty",
    "description": "\"Never Ricking Morty\" is the sixth episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Jeff Loveness and directed by Erica Hayes, the episode was broadcast on May 3, 2020 in the United States and on May 7, 2020 in the United Kingdom.",
    "source": "https://en.wikipedia.org/wiki/Never_Ricking_Morty"
  },
  "S04E07": {
    "title": "Promortyus",
    "description": "\"Promortyus\" is the seventh episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Jeff Loveness and directed by Bryan Newton, the episode was broadcast on May 10, 2020, in the United States.",
    "source": "https://en.wikipedia.org/wiki/Promortyus"
  },
  "S04E08": {
    "title": "The Vat of Acid Episode",
    "description": "\"The Vat of Acid Episode\" is the eighth episode of the fourth season of the Adult Swim animated television series Rick and Morty. Created by Dan Harmon, written by Jeff Loveness and Albro Lundy, and directed by Jacob Hair, the episode was broadcast on May 17, 2020, in the United States. The episode received largely positive reviews from critics, who praised the storyline and emotional depth. It won the Primetime Emmy Award for Outstanding Animated Program.",
    "source": "https://en.wikipedia.org/wiki/The_Vat_of_Acid_Episode"
  },
  "S04E09": {
    "title": "Childrick of Mort",
    "description": "\"Childrick of Mort\" is the ninth and penultimate episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by James Siciliano and directed by Kyounghee Lim, the episode was broadcast on May 24, 2020 in the United States.",
    "source": "https://en.wikipedia.org/wiki/Childrick_of_Mort"
  },
  "S04E10": {
    "title": "Star Mort Rickturn of the Jerri",
    "description": "\"Star Mort Rickturn of the Jerri\" is the tenth and final episode of the fourth season of the Adult Swim animated television series Rick and Morty. Written by Anne Lane and directed by Erica Hayes, the episode was broadcast on May 31, 2020, in the United States. The episode is notable for featuring the first official appearance of \"Space Beth\", following her creation in \"The ABC's of Beth\", with the New and Improved Galactic Federation following her back to Earth as she seeks to find out which Beth is a clone.",
    "source": "https://en.wikipedia.org/wiki/Star_Mort_Rickturn_of_the_Jerri"
  },
  "S05E01": {
    "title": "Mort Dinner Rick Andre",
    "description": "\"Mort Dinner Rick Andre\" is the premiere episode of the fifth season of the Adult Swim animated television series Rick and Morty. It is the 42nd episode of the series overall. Written by Jeff Loveness and directed by Jacob Hair, the episode was broadcast on June 20, 2021. It received positive reviews from critics, who deemed it a strong start to the season.",
    "source": "https://en.wikipedia.org/wiki/Mort_Dinner_Rick_Andre"
  },
  "S05E02": {
    "title": "Mortyplicity",
    "description": "\"Mortyplicity\" is the second episode of the fifth season of the Adult Swim animated television series Rick and Morty. It is the 43rd episode of the series overall. Written by Albro Lundy and directed by Lucas Gray, the episode was broadcast on June 27, 2021. The episode was praised by critics for its storyline and fast pacing.",
    "source": "https://en.wikipedia.org/wiki/Mortyplicity"
  },
  "S05E03": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  },
  "S05E04": {
    "title": "Rickdependence Spray",
    "description": "\"Rickdependence Spray\" is the fourth episode of the fifth season of the American television series Rick and Morty. It premiered in the United States on July 11, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rickdependence_Spray"
  },
  "S05E05": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  },
  "S05E06": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  },
  "S05E07": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  },
  "S05E08": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  },
  "S05E09": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  },
  "S05E10": {
    "title": "Rick and Morty season 5",
    "description": "The fifth season of the animated television series Rick and Morty consisted of 10 episodes, part of the 70 episodes ordered by Adult Swim after they renewed the series in 2018. The series stars Justin Roiland as both titular characters, alongside Chris Parnell as Jerry Smith, Spencer Grammer as Summer Smith, and Sarah Chalke as Beth Smith and Space Beth. The season premiered on June 20, 2021, and concluded on September 5, 2021.",
    "source": "https://en.wikipedia.org/wiki/Rick_and_Morty_season_5"
  }
}